In [1]:
import pandas as pd
import numpy as np

In [115]:
# 기온 데이터 읽어오기
temp_df = pd.read_csv('data/기온.csv', skiprows=7, engine='python')

In [116]:
temp_df.shape

(3712, 5)

In [117]:
temp_df.head()

           날짜  지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
0  2010-01-01  전국     -4.9    -11.0      0.9
1  2010-01-02  전국     -0.1     -5.5      5.5
2  2010-01-03  전국     -2.9     -6.9      1.4
3  2010-01-04  전국     -1.8     -5.1      2.2
4  2010-01-05  전국     -5.2     -8.7     -1.8

In [118]:
temp_df.drop('지점', axis=1, inplace=True)
temp_df.head()

           날짜  평균기온(℃)  최저기온(℃)  최고기온(℃)
0  2010-01-01     -4.9    -11.0      0.9
1  2010-01-02     -0.1     -5.5      5.5
2  2010-01-03     -2.9     -6.9      1.4
3  2010-01-04     -1.8     -5.1      2.2
4  2010-01-05     -5.2     -8.7     -1.8

In [119]:
temp_df.dtypes

날짜          object
평균기온(℃)    float64
최저기온(℃)    float64
최고기온(℃)    float64
dtype: object

In [120]:
temp_df.isnull().sum()

날짜         0
평균기온(℃)    0
최저기온(℃)    0
최고기온(℃)    0
dtype: int64

In [121]:
temp_df.describe()

           평균기온(℃)      최저기온(℃)      최고기온(℃)
count  3712.000000  3712.000000  3712.000000
mean     12.892861     8.171821    18.320205
std       9.788293    10.211749     9.795578
min     -10.800000   -14.800000    -7.400000
25%       4.200000    -0.700000     9.700000
50%      13.600000     8.400000    19.800000
75%      21.700000    17.400000    27.000000
max      30.300000    25.900000    36.600000

In [122]:
# 강수량 데이터 읽어오기
rainfall_df = pd.read_csv('data/강수량.csv', skiprows=7, engine='python')

In [123]:
rainfall_df.shape

(3712, 3)

In [124]:
rainfall_df.head()

           날짜  지점  강수량(mm)
0  2010-01-01  전국      0.0
1  2010-01-02  전국      0.8
2  2010-01-03  전국      0.0
3  2010-01-04  전국      5.9
4  2010-01-05  전국      0.7

In [12]:
rainfall_df.drop(['날짜', '지점'], axis=1, inplace=True)
rainfall_df.head()

   강수량(mm)
0      0.0
1      0.8
2      0.0
3      5.9
4      0.7

In [13]:
rainfall_df.dtypes

강수량(mm)    float64
dtype: object

In [14]:
rainfall_df.isnull().sum()

강수량(mm)    0
dtype: int64

In [15]:
rainfall_df.describe()

           강수량(mm)
count  3712.000000
mean      3.442457
std       8.745856
min       0.000000
25%       0.000000
50%       0.100000
75%       2.100000
max     106.300000

In [16]:
# 기온, 강수량 데이터 합치기
temp_rainfall_df = pd.concat([temp_df, rainfall_df], axis=1)
temp_rainfall_df.columns = ['date', 'avgTemp', 'minTemp', 'maxTemp', 'rainfall']
temp_rainfall_df.shape

(3712, 5)

In [17]:
temp_rainfall_df.isnull().sum()

date        0
avgTemp     0
minTemp     0
maxTemp     0
rainfall    0
dtype: int64

In [18]:
temp_rainfall_df.head()

         date  avgTemp  minTemp  maxTemp  rainfall
0  2010-01-01     -4.9    -11.0      0.9       0.0
1  2010-01-02     -0.1     -5.5      5.5       0.8
2  2010-01-03     -2.9     -6.9      1.4       0.0
3  2010-01-04     -1.8     -5.1      2.2       5.9
4  2010-01-05     -5.2     -8.7     -1.8       0.7

In [19]:
temp_rainfall_df.tail()

            date  avgTemp  minTemp  maxTemp  rainfall
3707  2020-02-25      7.5      5.7     10.0      28.1
3708  2020-02-26      7.0      3.1     11.9       1.5
3709  2020-02-27      5.3      1.2     10.4       0.1
3710  2020-02-28      4.5      1.7      6.8       2.7
3711  2020-02-29      6.7      2.7     12.1       0.0

In [20]:
temp_rainfall_df.dtypes

date         object
avgTemp     float64
minTemp     float64
maxTemp     float64
rainfall    float64
dtype: object

In [ ]:
# 평균 배추가격 데이터 읽어오기
# 여러 파일로 나눠진 배추가격 데이터를 반복문으로 읽어와서 하나의 df로 합치기
fileName_0 = [str(tmp) for tmp in range(2010, 2021)]    # 2010 ~ 2020
fileName_1 = [str(tmp) for tmp in range(1, 5)]    # 1 ~ 4

concated_df = pd.DataFrame(data={}, columns=['date', 'price'])

for tmp0 in fileName_0:
    for tmp1 in fileName_1:
        
        # 파일 읽기
        ori_df = pd.read_excel('data/' + tmp0 + '-' + tmp1 + '.xlsx')
        
        # 불필요한 열 제거
        ori_df.drop(ori_df.columns[0:3], axis=1, inplace=True)
        
        # 불필요한 행 제거
        ori_df.drop(ori_df.index[1:], inplace=True)
        
        # 행과 열을 바꾸고 price 컬럼명 지정
        ori_df = ori_df.T
        ori_df.columns = ['price']
        
        # index를 가져와서 date타입을 str로 형식에 맞게 바꾸고 리스트에 넣음
        index_list = ori_df.index
        index_list = [str(index).split(' ')[0].replace('2020', tmp0) for index in index_list]
        
        # 만든 리스트를 date컬럼으로 지정한 뒤 컬럼명 순서 재배치
        ori_df['date'] = index_list
        ori_df = ori_df[['date', 'price']]
        
        # 기존 데이터와 새로 읽은 파일의 데이터를 합침
        concated_df = pd.concat([concated_df, ori_df])
        
        # log
        print('읽은파일: ' + tmp0 + '-' + tmp1 + '.xlsx')
        print(ori_df.head())
        print(ori_df.isnull().sum())
        print('-' * 50)
        
        if tmp0 == '2020':
            break
        
concated_df.reset_index(drop=True, inplace=True)
concated_df.shape

In [37]:
concated_df.isnull().sum()

date     0
price    0
dtype: int64

In [46]:
# 기온, 강수량 데이터와 배추가격 데이터 합치기(최종)
merged_df = pd.merge(temp_rainfall_df, concated_df, how='outer')
merged_df.shape

(3712, 6)

In [47]:
merged_df.isnull().sum()

date           0
avgTemp        0
minTemp        0
maxTemp        0
rainfall       0
price       1205
dtype: int64

In [48]:
merged_df.head()

         date  avgTemp  minTemp  maxTemp  rainfall  price
0  2010-01-01     -4.9    -11.0      0.9       0.0    NaN
1  2010-01-02     -0.1     -5.5      5.5       0.8    NaN
2  2010-01-03     -2.9     -6.9      1.4       0.0    NaN
3  2010-01-04     -1.8     -5.1      2.2       5.9  2,123
4  2010-01-05     -5.2     -8.7     -1.8       0.7  2,209

In [49]:
merged_df.tail()

            date  avgTemp  minTemp  maxTemp  rainfall  price
3707  2020-02-25      7.5      5.7     10.0      28.1  4,396
3708  2020-02-26      7.0      3.1     11.9       1.5  4,296
3709  2020-02-27      5.3      1.2     10.4       0.1  4,296
3710  2020-02-28      4.5      1.7      6.8       2.7  4,296
3711  2020-02-29      6.7      2.7     12.1       0.0    NaN

In [95]:
# 결측값(주말 배추가격) 채우기 - 해당 주의 금요일 가격으로 채움
fillna_df = merged_df.fillna(method='ffill')
fillna_df.isnull().sum()

date        0
avgTemp     0
minTemp     0
maxTemp     0
rainfall    0
price       3
dtype: int64

In [96]:
fillna_df.head()

         date  avgTemp  minTemp  maxTemp  rainfall  price
0  2010-01-01     -4.9    -11.0      0.9       0.0    NaN
1  2010-01-02     -0.1     -5.5      5.5       0.8    NaN
2  2010-01-03     -2.9     -6.9      1.4       0.0    NaN
3  2010-01-04     -1.8     -5.1      2.2       5.9  2,123
4  2010-01-05     -5.2     -8.7     -1.8       0.7  2,209

In [98]:
# 앞의 3개의 데이터는 임의(1월 4일 가격)의 값으로 채움
fillna_df.iloc[:3].fillna('2,123', inplace=True)

fillna_df.isnull().sum()
# 결측치 완전히 채움

date        0
avgTemp     0
minTemp     0
maxTemp     0
rainfall    0
price       0
dtype: int64

In [99]:
# date는 필요 없으므로 제거함
fillna_df.index
fillna_df.drop('date', axis=1, inplace=True)

In [100]:
fillna_df.head()

   avgTemp  minTemp  maxTemp  rainfall  price
0     -4.9    -11.0      0.9       0.0  2,123
1     -0.1     -5.5      5.5       0.8  2,123
2     -2.9     -6.9      1.4       0.0  2,123
3     -1.8     -5.1      2.2       5.9  2,123
4     -5.2     -8.7     -1.8       0.7  2,209

In [101]:
fillna_df.dtypes
# 데이터 타입을 확인해보니 맞지 않는 부분이 있어서 바꿔줄 필요가 있음
# price -> float

avgTemp     float64
minTemp     float64
maxTemp     float64
rainfall    float64
price        object
dtype: object

In [107]:
# price를 float타입으로 바꿈
fillna_df['price'] = fillna_df['price'].apply(lambda x: x.replace(',', '')).astype('float')
fillna_df.head()

   avgTemp  minTemp  maxTemp  rainfall   price
0     -4.9    -11.0      0.9       0.0  2123.0
1     -0.1     -5.5      5.5       0.8  2123.0
2     -2.9     -6.9      1.4       0.0  2123.0
3     -1.8     -5.1      2.2       5.9  2123.0
4     -5.2     -8.7     -1.8       0.7  2209.0

In [109]:
# 데이터 전처리가 끝났으므로 csv 파일로 저장
fillna_df.to_csv("data/dataset.csv", mode='w', index=False)